/**
 * 6. Написать метод, которому в качестве параметра передается целое число,
 * метод должен вернуть true, если число отрицательное;
 */
public class Task6 {
    public static void main(String[] args){
        int val = -27;

        if (val<0) {
            System.out.println("True");
        }
    }
}
