/**5. Написать метод, которому в качестве параметра передается целое
 * число, метод должен напечатать в консоль положительное число передали
 * или отрицательное (Замечание ноль считаем положительным числом.);
 */
public class Task5 {
    public static void main(String[] args) {
       int val = 0;

       if (val<0) {
           System.out.println("Число отрицательное");
       }
       else {
           System.out.println("Число положительное");
       }
    }
}
